# Напишите функцию number_to_words(num), которая принимает
# в качестве аргумента натуральное число num и возвращает
# его словесное описание на русском языке.
#
# Примечание 1.
# Считайте, что число 1 ≤ num ≤ 99.
#
# Примечание 2.
# Следующий программный код:
#
# print(number_to_words(7))
# print(number_to_words(85))
# должен выводить:
#
# семь
# восемьдесят пять
l = ["одинадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать",
         "семнадцать", "восемнадцать", "девятнадцать"]
l2 = ['один', "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
l3 = ['десять', "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят",
          "восемьдесят", "девяносто"]
def ll2l3(x):
    a = ""
    for i in range(10):
        if x//10 == i and x >=20:
            g =  l3[i-1]
            a = a + g
    for j in range(10):
        if x%10 == j and (x >=20 or x<=10):
            t = l2[j-1]
            a = a + ' '+ t
    for q in range(10):
        if x == q+11:
            m = l[q]
            a = a + m
    return a
print(ll2l3(99))
